victorzhengg/nrf5_sdk_17_1_0/components/ble/ble_services/ble_mnss/ble_mnss.c
/**
 * Copyright (c) 2013 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "sdk_common.h"
#include "ble_mnss.h"
#include "ble_srv_common.h"
#include "nrf_log.h"


///**@brief Function for handling the Write event.
// *
// * @param[in] p_lbs      LED Button Service structure.
// * @param[in] p_ble_evt  Event received from the BLE stack.
// */
//static void on_write(ble_lbs_t * p_lbs, ble_evt_t const * p_ble_evt)
//{
//    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

//    if (   (p_evt_write->handle == p_lbs->led_char_handles.value_handle)
//        && (p_evt_write->len == 1)
//        && (p_lbs->led_write_handler != NULL))
//    {
//        p_lbs->led_write_handler(p_ble_evt->evt.gap_evt.conn_handle, p_lbs, p_evt_write->data[0]);
//    }
//}


void ble_mnss_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    ble_mnss_t * p_mnss = (ble_mnss_t *)p_context;
		ble_gatts_evt_write_t const * p_evt_write;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTS_EVT_WRITE:
						p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

						if (   (p_evt_write->handle == p_mnss->data_write_handle.value_handle)
								&& (p_evt_write->len == sizeof(ble_mnss_data_t))
								&& (p_mnss->data_write_handler != NULL))
						{
								p_mnss->data_write_handler(p_ble_evt->evt.gap_evt.conn_handle, 
																					 p_mnss,
																					 (ble_mnss_data_t *)&(p_evt_write->data[0]));
						}				
            break;

        default:
            // No implementation needed.
            break;
    }
}


uint32_t ble_mnss_init(ble_mnss_t * p_mnss, const ble_mnss_init_t * p_mnss_init)
{
    uint32_t              err_code;
    ble_uuid_t            ble_uuid;
    ble_add_char_params_t add_char_params;

    // Initialize service structure.
    p_mnss->data_write_handler = p_mnss_init->data_write_handler;

    // Add service.
    ble_uuid128_t base_uuid = {MNSS_UUID_BASE};
    err_code = sd_ble_uuid_vs_add(&base_uuid, &p_mnss->uuid_type);
    VERIFY_SUCCESS(err_code);

    ble_uuid.type = p_mnss->uuid_type;
    ble_uuid.uuid = MNSS_UUID_SERVICE;

    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY, &ble_uuid, &p_mnss->service_handle);
    VERIFY_SUCCESS(err_code);

    // add data write characteristic.
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = MNSS_UUID_WRITE_CHAR;
    add_char_params.uuid_type         = p_mnss->uuid_type;
    add_char_params.init_len          = sizeof(ble_mnss_data_t);
    add_char_params.max_len           = sizeof(ble_mnss_data_t);
    add_char_params.char_props.write_wo_resp   = 1;
    add_char_params.write_access       = SEC_OPEN;


    err_code = characteristic_add(p_mnss->service_handle,
                                  &add_char_params,
                                  &p_mnss->data_write_handle);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // add data read characteristic.
    memset(&add_char_params, 0, sizeof(add_char_params));
    add_char_params.uuid              = MNSS_UUID_READ_CHAR;
    add_char_params.uuid_type         = p_mnss->uuid_type;
    add_char_params.init_len          = sizeof(ble_mnss_data_t);
    add_char_params.max_len           = sizeof(ble_mnss_data_t);
    add_char_params.char_props.read   = 1;
    add_char_params.read_access       = SEC_OPEN;


    err_code = characteristic_add(p_mnss->service_handle,
                                  &add_char_params,
                                  &p_mnss->data_read_handle);

    return err_code;
}


//uint32_t ble_lbs_on_button_change(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t button_state)
//{
//    ble_gatts_hvx_params_t params;
//    uint16_t len = sizeof(button_state);

//    memset(&params, 0, sizeof(params));
//    params.type   = BLE_GATT_HVX_NOTIFICATION;
//    params.handle = p_lbs->button_char_handles.value_handle;
//    params.p_data = &button_state;
//    params.p_len  = &len;

//    return sd_ble_gatts_hvx(conn_handle, &params);
//}
